results/results_1/aggregated/out 128/prev/test2/output.txt
[Sun Jul 19 05:18:47 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Sun Jul 19 05:18:47 AM UTC 2026] === Rate 5 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
/sgl-workspace/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 1500 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=1500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=5.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=1500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=5.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 3276923
#Output tokens: 192000
#Total images: 1500
#Images per request: 1 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=192000
  Text prompt tokens (with chat template): avg=142.6, total=213923
  Text prompt overhead: avg=14.6, total=21923
  Vision tokens: avg=2042.0, total=3063000

Created 1500 random jpeg images with average 2089839 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1500/1500 [05:35<00:00,  4.48it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    5.0       
Max request concurrency:                 not set   
Successful requests:                     1500      
Benchmark duration (s):                  335.14    
Total input tokens:                      3276923   
Total input text tokens:                 213923    
Total input vision tokens:               3063000   
Total generated tokens:                  192000    
Total generated tokens (retokenized):    190712    
Request throughput (req/s):              4.48      
Input token throughput (tok/s):          9777.88   
Output token throughput (tok/s):         572.90    
Peak output token throughput (tok/s):    1803.00   
Peak concurrent requests:                169       
Total token throughput (tok/s):          10350.79  
Concurrency:                             112.84    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   25210.77  
Median E2E Latency (ms):                 27526.12  
P90 E2E Latency (ms):                    33308.25  
P95 E2E Latency (ms):                    34240.01  
P99 E2E Latency (ms):                    35406.75  
---------------Time to First Token----------------
Mean TTFT (ms):                          13836.47  
Median TTFT (ms):                        16321.17  
P90 TTFT (ms):                           22006.22  
P95 TTFT (ms):                           23081.43  
P99 TTFT (ms):                           24149.73  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          89.56     
Median TPOT (ms):                        90.82     
P90 TPOT (ms):                           94.38     
P95 TPOT (ms):                           94.99     
P99 TPOT (ms):                           101.99    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           91.26     
Median ITL (ms):                         31.26     
P90 ITL (ms):                            204.33    
P95 ITL (ms):                            386.97    
P99 ITL (ms):                            537.96    
Max ITL (ms):                            3084.77   
==================================================
[Sun Jul 19 05:29:35 AM UTC 2026] Rate 5 done.
[Sun Jul 19 05:29:35 AM UTC 2026] All rates complete.